In [1]:
!pip show pandas_profiling

Name: pandas-profiling
Version: 3.6.6
Summary: Deprecated 'pandas-profiling' package, use 'ydata-profiling' instead
Home-page: https://github.com/ydataai/pandas-profiling
Author: YData Labs Inc
Author-email: opensource@ydata.ai
License: MIT
Location: /home/shayan/.local/lib/python3.10/site-packages
Requires: ydata-profiling
Required-by:

In [2]:
!pip show ydata_profiling

Name: ydata-profiling
Version: 4.4.0
Summary: Generate profile report for pandas DataFrame
Home-page: https://github.com/ydataai/ydata-profiling
Author: YData Labs Inc
Author-email: opensource@ydata.ai
License: MIT
Location: /home/shayan/.local/lib/python3.10/site-packages
Requires: dacite, htmlmin, imagehash, jinja2, matplotlib, multimethod, numpy, pandas, phik, pydantic, PyYAML, requests, scipy, seaborn, statsmodels, tqdm, typeguard, visions, wordcloud
Required-by: pandas-profiling

In [3]:
from sklearn.datasets import load_diabetes
import pandas as pd
from pandas_profiling import ProfileReport
from ydata_profiling import ProfileReport as y_profile_report
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

/tmp/ipykernel_80944/3381659013.py:3: DeprecationWarning: `import pandas_profiling` is going to be deprecated by April 1st. Please use `import ydata_profiling` instead.
  from pandas_profiling import ProfileReport

In [4]:
# Load the Diabetes dataset
diabetes = load_diabetes()

In [5]:
# Convert the dataset into a pandas DataFrame
df = pd.DataFrame(data=diabetes.data, columns=diabetes.feature_names)

In [6]:
df.sample(3)

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
31,-0.023677,-0.044642,-0.065486,-0.081413,-0.038720,-0.053610,0.059685,-0.076395,-0.037129,-0.042499
188,0.005383,-0.044642,-0.002973,0.049415,0.074108,0.070710,0.044958,-0.002592,-0.001496,-0.009362
119,0.016281,-0.044642,-0.047163,-0.002228,-0.019456,-0.042963,0.033914,-0.039493,0.027364,0.027917

In [7]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [8]:
data = sns.load_dataset("titanic")

In [9]:
data.sample(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
100,0,3,female,28.0,0,0,7.8958,S,Third,woman,False,NaN,Southampton,no,True
531,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
133,1,2,female,29.0,1,0,26.0000,S,Second,woman,False,NaN,Southampton,yes,False

In [10]:
# Add the target variable 'Survived' based on 'alive' column
data['Survived'] = data['alive'].apply(lambda x: 1 if x == 'yes' else 0)
data.drop("alive",axis=1,inplace=True)

In [11]:
data.sample(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alone,Survived
575,0,3,male,19.0,0,0,14.50,S,Third,man,True,NaN,Southampton,True,0
260,0,3,male,NaN,0,0,7.75,Q,Third,man,True,NaN,Queenstown,True,0
853,1,1,female,16.0,0,1,39.40,S,First,woman,False,D,Southampton,False,1

In [12]:
# from pandas_profiling import profile_report

In [13]:
# test_1 = data.profile_report()

In [14]:
# # Generate a profile report
# profile = ProfileReport(data, title='YData Profiling Report', explorative=True)

# # Save the report to a file (optional)
# profile.to_file("report.html")

# # Display the report in a Jupyter Notebook (optional)
# # profile.to_notebook_iframe()

In [15]:
# Generate a profile report
profile = y_profile_report(data, title='YData Profiling Report', explorative=True)

# Save the report to a file (optional)
profile.to_file("y_report.html")

# Display the report in a Jupyter Notebook (optional)
# profile.to_notebook_iframe()

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

:

: